#include "Constant.h"


CoorSys::CoorSys()
{
	a = 0.0;//长半轴 单位m
	b = 0.0;//短半轴 单位m
	c = 0.0;//极曲率半径 单位m
	e = 0.0;//第一偏心率
	eSquare = 0.0;//第一偏心率的平方
	e2 = 0.0;//第二偏心率
	e2Square = 0.0;//第二偏心率的平方
	f = 0.0;//扁率
	GM = 0.0;//地心引力常数 单位m³s^-2
	omega = 0.0;//自转角速度 单位rad/s
}

CGCS2000::CGCS2000()
{
	a = 6378137.0;//长半轴 单位m
	b = 6356752.3141;//短半轴 单位m
	c = 6399593.6259;//极曲率半径 单位m
	e = 0.08181919104281517;//第一偏心率
	eSquare = 0.00669438002290;//第一偏心率的平方
	e2 = sqrt(a * a - b * b) / b;//第二偏心率
	e2Square = 0.00673949677548;//第二偏心率的平方
	f = 1 / 298.257222101;//扁率
	GM = 3.986004418e+14;//地心引力常数 单位m³s^-2
	omega = 7.292115e-5;//自转角速度 单位rad/s
}

WGS84::WGS84()
{
	a = 6378137.0;//长半轴 单位m
	b = 6356752.3142;//短半轴 单位m
	c = 6399593.62586;//极曲率半径 单位m
	e = 0.08181919084248535;//第一偏心率
	eSquare = 0.00669437999013;//第一偏心率的平方
	e2 = sqrt(a * a - b * b) / b;//第二偏心率
	e2Square = 0.00673949674227;//第二偏心率的平方
	f = 1 / 298.257223563;//扁率
	GM = 3.986005e+14;//地心引力常数 单位m³s^-2
	omega = 7.292115e-5;//自转角速度 单位rad/s
}
